{
  "basics": {
    "name": "Kassapa Gamagedara",
    "label": "PhD Student",
    "image": "",
    "email": "kassapa0@gmail.com",
    "phone": "+1-315-244-1112",
    "url": "https://kassapa092.github.io",
    "summary": "Excited to apply my advanced academic training, research experience, and problem-solving abilities to contribute to process optimization, innovation, and efficiency in semiconductor manufacturing.",
    "location": {
      "address": "",
      "postalCode": "NY 13676",
      "city": "Potsdam",
      "countryCode": "US",
      "region": "New York"
    },
    "profiles": [
      {
        "network": "LinkedIn",
        "username": "kassapa-gamagedara-a88bb2260",
        "url": "https://www.linkedin.com/in/kassapa-gamagedara-a88bb2260/"
      }
    ]
  },
  "work": [
  ],
  "volunteer": [
  ],
  "education": [
    {
      "institution": "Clarkson University",
      "location": "Potsdam, NY",
      "url": "https://www.clarkson.edu",
      "area": "Physics",
      "studyType": "PhD",
      "startDate": "2021-08-01",
      "endDate": "Current",
      "score": "4",
      "courses": ["Tribo-electrochemistry", "Chemical mechanical planarization (CMP)", "Optimizing CMP slurries", "Material removal", "Galvanic corrosion", "Material selectivity"]
    },
    {
      "institution": "Clarkson University",
      "location": "Potsdam, NY",
      "url": "https://www.clarkson.edu",
      "area": "Physics",
      "studyType": "MSc",
      "startDate": "2019-08-01",
      "endDate": "2021-08-01",
      "score": "3.52",
      "courses": []
    },
    {
      "institution": "University of Peradeniya",
      "location": "Peradeniya, Sri Lanka",
      "url": "https://www.pdn.ac.lk",
      "area": "Physics of Materials",
      "studyType": "MSc",
      "startDate": "2018-08-01",
      "endDate": "2016-08-01",
      "score": "3.50",
      "courses": ["Development of a flexible polymeric composite possessing magnetic and electrical conducting properties"]
    },
    {
      "institution": "University of Peradeniya",
      "location": "Peradeniya, Sri Lanka",
      "url": "https://www.pdn.ac.lk",
      "area": "Mathematics and Statistics",
      "studyType": "BSc",
      "startDate": "2015-08-01",
      "endDate": "2013-08-01",
      "score": "3.04",
      "courses": []
    }
  ],
  "awards": [
    {
      "title": "Outstanding Graduate Student Award",
      "date": "2025-04-01",
      "awarder": "Coulter School of Engineering and Applied Sciences, Clarkson University",
      "url": "https://www.clarkson.edu",
      "summary": "I was honored with the Distinguished Graduate Student Award during the Celebration and Recognition of Excellence Weekend (CREW) at Clarkson University. This award is a selective recognition given to graduate students who demonstrate outstanding research contributions, academic excellence, and leadership within the School of Engineering. It acknowledges the impact of my doctoral research on Chemical Mechanical Planarization (CMP) and tribo-electrochemistry of metals and alloys, particularly its relevance to semiconductor manufacturing and emerging flexible device technologies. Beyond research, the award also reflects my role in mentoring students, managing laboratory operations, and contributing to Clarkson’s research community, underscoring my commitment to advancing both science and collaborative education."
    },
    {
      "title": "Best graduate research poster",
      "date": "2022-07-01",
      "awarder": "Clarkson University",
      "url": "https://www.clarkson.edu",
      "summary": "I received the Best Graduate Poster Award in Chemistry, Electrochemistry, and Materials Science at the Summer RAPS (Research and Project Showcase) event organized by Clarkson University. My poster, “Measurement of Active Sample Area in Electroanalytical Studies of CMP Reactions Under Polishing Conditions,” addressed the challenge of accurately defining the electrochemically active area during CMP. This work demonstrated how precise measurement of active contact areas is essential for correctly interpreting electroanalytical data under polishing conditions, providing deeper insight into the balance between chemical reactions and mechanical removal. The award recognized both the significance of these findings for CMP research and the effectiveness of communicating them to a multidisciplinary audience."
    }
  ],
  "publications": [
    {
      "name": "Tribo-Electrochemical Characterization of Brush-Scrubbed Post-CMP Cleaning: Results for Tartrate-Supported Removal of Residual Oxides from Copper Films",
      "publisher": "MDPI, Lubricants",
      "releaseDate": "2025",
      "url": "",
      "summary": ""
    },
    {
      "name": "Tribo-Electrochemical Considerations for Assessing Galvanic Corrosion Characteristics of Metals in Chemical Mechanical Planarization",
      "publisher": "MDPI, Electrochem",
      "releaseDate": "2025",
      "url": "",
      "summary": ""
    },
    {
      "name": "Tribo-Electrochemical Mechanism of Material Removal Examined for Chemical Mechanical Planarization of Stainless-Steel Using Citrate Buffer as a Complexing Agent.",
      "publisher": "MDPI, Materials",
      "releaseDate": "2025",
      "url": "",
      "summary": ""
    },
    {
      "name": "Mechanisms of Chemically Promoted Material Removal Examined for Molybdenum and Copper CMP in Weakly Alkaline Citrate-Based Slurries",
      "publisher": "MDPI, Materials",
      "releaseDate": "2024",
      "url": "",
      "summary": ""
    },
    {
      "name": "Experimental Strategies for Studying Tribo-Electrochemical Aspects of Chemical-Mechanical Planarization.",
      "publisher": "ICPT Conference Proceedings",
      "releaseDate": "2022",
      "url": "https://www.mdpi.com/2075-4442/12/2/63",
      "summary": ""
    },
    {
      "name": "Tribo-electroanalytical evaluation of CMP slurries and post-CMP cleaning solutions",
      "publisher": "MDPI, Materials",
      "releaseDate": "2024",
      "url": "",
      "summary": ""
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Fluent",
      "icon": ""
    },
    {
      "language": "Sinhala",
      "fluency": "Native speaker",
      "icon": ""
    }
  ]
}
